SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
/*!
    \file    gd32e23x_hal_uart.c
    \brief   UART driver
    
    \version 2019-03-14, V1.0.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x_hal.h"

static uint16_t _uart_data_bit_mask_get(hal_uart_dev_struct *uart);
static FlagStatus _uart_error_flag_get(hal_uart_dev_struct *uart);
static void _uart_transmit_complete_interrupt(void *uart);
static void _uart_transmit_interrupt(void *uart);
static void _uart_receive_interrupt(void *uart);
static void _uart_transmit_dma(void *dma);
static void _uart_receive_dma(void *dma);
static void _uart_dma_error(void *dma);

/*!
    \brief      initialize the UART struct with the default values, note that this function must be
                called after the structure is created
    \param[in]  hal_struct_type: type of UART struct for initialization
      \arg        HAL_UART_INIT_STRUCT: initialization structure
      \arg        HAL_UART_INIT_EX_STRUCT: initialization extend structure
      \arg        HAL_UART_DEV_STRUCT: device information structure
      \arg        HAL_UART_USER_CALLBCAK_STRUCT: user callback structure
      \arg        HAL_UART_IRQ_INIT_STRUCT: interrupt callback initialization structure
    \param[in]  p_struct: structure pointer
    \param[out] none
    \retval     none
*/
void hal_uart_struct_init(hal_uart_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == p_struct){
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
        return;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    switch(hal_struct_type){
    case HAL_UART_INIT_STRUCT:
        /* initialize uart initialization structure with the default values */
        ((hal_uart_init_struct*)p_struct)->work_mode = UART_WORK_MODE_ASYN;
        ((hal_uart_init_struct*)p_struct)->baudrate = 115200U;
        ((hal_uart_init_struct*)p_struct)->direction = UART_DIRECTION_RX_TX;
        ((hal_uart_init_struct*)p_struct)->over_sample = UART_OVER_SAMPLE_16;
        ((hal_uart_init_struct*)p_struct)->sample_method = UART_THREE_SAMPLE_BIT;
        ((hal_uart_init_struct*)p_struct)->parity = UART_PARITY_NONE;
        ((hal_uart_init_struct*)p_struct)->stop_bit = UART_STOP_BIT_1;
        ((hal_uart_init_struct*)p_struct)->word_length = UART_WORD_LENGTH_8BIT;
        ((hal_uart_init_struct*)p_struct)->hardware_flow = UART_HARDWARE_FLOW_NONE;
    
        ((hal_uart_init_struct*)p_struct)->lin_mode.break_frame_length = UART_LIN_BREAK_DETECTION_10BIT;
        ((hal_uart_init_struct*)p_struct)->multiprocessor_mode.address = 0U;
        ((hal_uart_init_struct*)p_struct)->multiprocessor_mode.addr_length = UART_MULTIPROCESSOR_ADDRESS_4BIT;
        ((hal_uart_init_struct*)p_struct)->multiprocessor_mode.wakeup_mode = UART_MULTIPROCESSOR_WAKEUP_IDLE;
        ((hal_uart_init_struct*)p_struct)->rs485_mode.de_assertion_time = 0U;
        ((hal_uart_init_struct*)p_struct)->rs485_mode.de_deassertion_time = 0U;
        ((hal_uart_init_struct*)p_struct)->rs485_mode.de_polarity = UART_RS485_DE_POLARITY_HIGH;
        break;
    
    case HAL_UART_INIT_EX_STRUCT:
        /* initialize uart extend initialization structure with the default values */
        ((hal_uart_init_ex_struct*)p_struct)->data_bit_invert = DISABLE;
        ((hal_uart_init_ex_struct*)p_struct)->first_bit_msb = DISABLE;
        ((hal_uart_init_ex_struct*)p_struct)->overrun_disable = DISABLE;
        ((hal_uart_init_ex_struct*)p_struct)->rx_error_dma_stop = DISABLE;
        ((hal_uart_init_ex_struct*)p_struct)->rx_level_invert = DISABLE;
        ((hal_uart_init_ex_struct*)p_struct)->tx_level_invert = DISABLE;
        ((hal_uart_init_ex_struct*)p_struct)->tx_rx_swap = DISABLE;
        ((hal_uart_init_ex_struct*)p_struct)->autobaud.use = DISABLE;
        ((hal_uart_init_ex_struct*)p_struct)->autobaud.detection_mode = UART_AUTOBAUD_BY_BIT_SEQUENCE_1XXXXXXX;
        ((hal_uart_init_ex_struct*)p_struct)->wakeup.use = DISABLE;
        ((hal_uart_init_ex_struct*)p_struct)->wakeup.wakeup_by = UART_WAKEUP_BY_ADDRESS;
        break;
    
    case HAL_UART_DEV_STRUCT:
        /* initialize uart device information structure with the default values */
        ((hal_uart_dev_struct*)p_struct)->periph = 0U;
        ((hal_uart_dev_struct*)p_struct)->uart_irq.error_handle = NULL;
        ((hal_uart_dev_struct*)p_struct)->uart_irq.receive_complete_handle = NULL;
        ((hal_uart_dev_struct*)p_struct)->uart_irq.transmit_complete_handle = NULL;
        ((hal_uart_dev_struct*)p_struct)->uart_irq.transmit_ready_handle = NULL;
        ((hal_uart_dev_struct*)p_struct)->uart_irq.wakeup_handle = NULL;
        ((hal_uart_dev_struct*)p_struct)->p_dma_rx = NULL;
        ((hal_uart_dev_struct*)p_struct)->p_dma_tx = NULL;
        ((hal_uart_dev_struct*)p_struct)->txbuffer.buffer = NULL;
        ((hal_uart_dev_struct*)p_struct)->txbuffer.length = 0U;
        ((hal_uart_dev_struct*)p_struct)->txbuffer.pos = 0U;
        ((hal_uart_dev_struct*)p_struct)->rxbuffer.buffer = NULL;
        ((hal_uart_dev_struct*)p_struct)->rxbuffer.length = 0U;
        ((hal_uart_dev_struct*)p_struct)->rxbuffer.pos = 0U;
        ((hal_uart_dev_struct*)p_struct)->error_state = HAL_USART_ERROR_NONE;
        ((hal_uart_dev_struct*)p_struct)->tx_state = UART_STATE_FREE;
        ((hal_uart_dev_struct*)p_struct)->rx_state = UART_STATE_FREE;
        ((hal_uart_dev_struct*)p_struct)->last_error = HAL_USART_ERROR_NONE;
        ((hal_uart_dev_struct*)p_struct)->priv = NULL;
        break;
    
    case HAL_UART_USER_CALLBCAK_STRUCT:
        /* initialize user callback structure with the default values */
        ((hal_uart_user_callback_struct*)p_struct)->complete_func = NULL;
        ((hal_uart_user_callback_struct*)p_struct)->error_func = NULL;
        break;
    
    case HAL_UART_IRQ_INIT_STRUCT:
        /* initialize interrupt callback structure with the default values */
        ((hal_uart_irq_struct*)p_struct)->address_match_handle = NULL;
        ((hal_uart_irq_struct*)p_struct)->cts_change_handle = NULL;
        ((hal_uart_irq_struct*)p_struct)->error_handle = NULL;
        ((hal_uart_irq_struct*)p_struct)->idle_line_detected_handle = NULL;
        ((hal_uart_irq_struct*)p_struct)->lin_break_detected_handle = NULL;
        ((hal_uart_irq_struct*)p_struct)->receive_complete_handle = NULL;
        ((hal_uart_irq_struct*)p_struct)->transmit_complete_handle = NULL;
        ((hal_uart_irq_struct*)p_struct)->transmit_ready_handle = NULL;
        ((hal_uart_irq_struct*)p_struct)->wakeup_handle = NULL;
        break;
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize the UART
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_uart_deinit(hal_uart_dev_struct *uart)
{
    uint32_t periph;
    
