SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
    periph = uart->periph;
    if((USART0 == periph) || (USART1 == periph)){
        /* deinitialize the periph and the device information sturcture */
        usart_deinit(periph);
        hal_uart_struct_init(HAL_UART_DEV_STRUCT, uart);
        uart->periph = periph;
    }else{
        HAL_DEBUGE("parameter [uart->periph] value is invalid");
    }
}

/*!
    \brief      initialize the UART with specified values
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which USART is initialized
    \param[in]  p_init: the initialization data needed to initialize UART
                  work_mode: UART_WORK_MODE_ASYN, UART_WORK_MODE_SINGLE_WIRE, UART_WORK_MODE_MULTIPROCESSCOR
                             UART_WORK_MODE_LIN, UART_WORK_MODE_RS485
                  baudrate: communication baudrate
                  parity: UART_PARITY_NONE, UART_PARITY_EVEN, UART_PARITY_ODD
                  word_length: UART_WORD_LENGTH_8BIT, UART_WORD_LENGTH_9BIT
                  stop_bit: UART_STOP_BIT_1, UART_STOP_BIT_0_5, UART_STOP_BIT_2, UART_STOP_BIT_1_5
                  over_sample: UART_OVER_SAMPLE_8, UART_OVER_SAMPLE_16
                  sample_method: UART_THREE_SAMPLE_BIT, UART_ONE_SAMPLE_BIT
                  direction: UART_DIRECTION_RX_TX, UART_DIRECTION_RX_ONLY, UART_DIRECTION_TX_ONLY
                  hardware_flow: UART_HARDWARE_FLOW_NONE, UART_HARDWARE_FLOW_RTS_ONLY, UART_HARDWARE_FLOW_CTS_ONLY
                                 UART_HARDWARE_FLOW_RTS_CTS
                  lin_mode: LIN mode struct (USART0 only)
                    break_frame_length: UART_LIN_BREAK_DETECTION_10BIT, UART_LIN_BREAK_DETECTION_11BIT
                  rs485_mode: RS485 mode struct
                    de_polarity: UART_RS485_DE_POLARITY_HIGH, UART_RS485_DE_POLARITY_LOW
                    de_assertion_time: 0 - 31
                    de_deassertion_time: 0 - 31
                  multiprocessor_mode: multi-processor mode struct
                    wakeup_mode: UART_MULTIPROCESSOR_WAKEUP_IDLE, UART_MULTIPROCESSOR_WAKEUP_ADDRESS
                    address: 0 - 15(4-bit address detection), 0 - 255(full-bit address detection)
                    addr_length: UART_MULTIPROCESSOR_ADDRESS_4BIT, UART_MULTIPROCESSOR_ADDRESS_FULLBIT
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32e23x_hal.h
*/
int32_t hal_uart_init(hal_uart_dev_struct *uart, uint32_t periph, \
                      hal_uart_init_struct *p_init)
{
    uint32_t reg_temp;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check UART pointer and p_init address */
    if((NULL == uart) || (NULL == p_init)){
        HAL_DEBUGE("pointer [uart] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check periph parameter */
    if((USART0 != periph) && (USART1 != periph)){
        HAL_DEBUGE("parameter [periph] value is invalid"); 
        return HAL_ERR_VAL;
    }
    
    /* check periph value from UART device struct */
    if(0 != uart->periph){
        HAL_DEBUGI("periph value from uart device struct has been rewrite");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    uart->periph = periph;
    uart->work_mode = p_init->work_mode;
    
    usart_disable(periph);
    
    /* CTL0 register configure */
    reg_temp = USART_CTL0(periph);
    reg_temp &= ~(USART_CTL0_PM | USART_CTL0_PCEN | USART_CTL0_WL | USART_CTL0_OVSMOD | \
                  USART_CTL0_REN | USART_CTL0_TEN);
    reg_temp |= (p_init->direction | p_init->over_sample | p_init->parity | \
                 p_init->word_length);
    USART_CTL0(periph) = reg_temp;
    
    /* CTL1 register configure */
    reg_temp = USART_CTL1(periph);
    reg_temp &= ~(USART_CTL1_STB);
    reg_temp |= (p_init->stop_bit);
    USART_CTL1(periph) = reg_temp;
    
    /* CTL2 register configure */
    reg_temp = USART_CTL2(periph);
    reg_temp &= ~(USART_CTL2_CTSEN | USART_CTL2_RTSEN | USART_CTL2_OSB);
    reg_temp |= (p_init->hardware_flow | p_init->sample_method);
    USART_CTL2(periph) = reg_temp;
    
    /* boudrate configure */
    usart_baudrate_set(periph, p_init->baudrate);
    /* get the data bit mask */
    uart->data_bit_mask = _uart_data_bit_mask_get(uart);
    /* disable the SMARTCARD mode, Half-Duplex mode, IRDA mode, LIN mode and clock */
    usart_smartcard_mode_disable(periph);
    usart_halfduplex_disable(periph);
    usart_irda_mode_disable(periph);
    usart_clock_disable(periph);
    usart_lin_mode_disable(periph);
    
    if(UART_WORK_MODE_ASYN != p_init->work_mode){
        switch(p_init->work_mode){
        case UART_WORK_MODE_MULTIPROCESSCOR:
            /* multiprocessor mode configure */
            usart_mute_mode_wakeup_config(periph, p_init->multiprocessor_mode.wakeup_mode);
            
            if(UART_MULTIPROCESSOR_WAKEUP_IDLE != p_init->multiprocessor_mode.wakeup_mode){
                usart_address_detection_mode_config(periph, p_init->multiprocessor_mode.addr_length);
                usart_address_config(periph, p_init->multiprocessor_mode.address);
            }
            /* enable mute mode */
            usart_mute_mode_enable(periph);
            break;
        case UART_WORK_MODE_LIN:
            /* LIN mode configure */
            usart_lin_break_detection_length_config(periph, p_init->lin_mode.break_frame_length);
            usart_lin_mode_enable(periph);
            break;
        case UART_WORK_MODE_RS485:
            p_init->rs485_mode.de_assertion_time &= BITS(0,4);
            p_init->rs485_mode.de_deassertion_time &= BITS(0,4);
        
            /* RS485 mode configure */
            usart_driver_assertime_config(periph, p_init->rs485_mode.de_assertion_time);
            usart_driver_deassertime_config(periph, p_init->rs485_mode.de_deassertion_time);
            usart_depolarity_config(periph, p_init->rs485_mode.de_polarity);
            /* enable RS485 driver */
            usart_rs485_driver_enable(periph);
            break;
        case UART_WORK_MODE_SINGLE_WIRE:
            /* enable single wire(half-duplex) mode */
            usart_halfduplex_enable(periph);
            break;
        default:
            break;
        } 
    }
    
    /* reset the Rx and Tx state */
    uart->tx_state = UART_STATE_FREE;
    uart->rx_state = UART_STATE_FREE;
    
