SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize the UART with specified values when using extended functions
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which USART is initialized
    \param[in]  p_init: the initialization data needed to initialize UART using extended functions
                  first_bit_msb: ENABLE, DISABLE
                  tx_rx_swap: ENABLE, DISABLE
                  rx_level_invert: ENABLE, DISABLE
                  tx_level_invert: ENABLE, DISABLE
                  data_bit_invert: ENABLE, DISABLE
                  overrun_disable: ENABLE, DISABLE
                  rx_error_dma_stop: ENABLE, DISABLE
                  autobaud: auto baudrate detection struct
                    use: ENABLE, DISABLE
                    detection_mode: UART_AUTOBAUD_BY_BIT_SEQUENCE_1XXXXXXX, UART_AUTOBAUD_BY_BIT_SEQUENCE_10XXXXXX
                  wakeup: wakeup mode struct
                    use: ENABLE, DISABLE
                    wakeup_by: UART_WAKEUP_BY_ADDRESS, UART_WAKEUP_BY_START_BIT, UART_WAKEUP_BY_RBNE_SET
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32e23x_hal.h
*/
int32_t hal_uart_init_ex(hal_uart_dev_struct *uart, uint32_t periph, \
                      hal_uart_init_ex_struct *p_init)
{
    uint32_t reg_temp;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_init)){
        HAL_DEBUGE("pointer [uart] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameters */
    if((USART0 != periph) && (USART1 != periph)){
        HAL_DEBUGE("parameter [periph] value is invalid"); 
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    uart->periph = periph;
    usart_disable(periph);
    
    /* configure the data bit invert function */
    if(ENABLE == p_init->data_bit_invert){
        USART_CTL1(periph) |= USART_CTL1_DINV;
    }else{
        USART_CTL1(periph) &= ~(USART_CTL1_DINV);
    }
    
    /* configure the rx level invert function */
    if(ENABLE == p_init->rx_level_invert){
        USART_CTL1(periph) |= USART_CTL1_RINV;
    }else{
        USART_CTL1(periph) &= ~(USART_CTL1_RINV);
    }
    
    /* configure the tx level invert function */
    if(ENABLE == p_init->tx_level_invert){
        USART_CTL1(periph) |= USART_CTL1_TINV;
    }else{
        USART_CTL1(periph) &= ~(USART_CTL1_TINV);
    }
    
    /* configure the tx rx swap function */
    if(ENABLE == p_init->tx_rx_swap){
        USART_CTL1(periph) |= USART_CTL1_STRP;
    }else{
        USART_CTL1(periph) &= ~(USART_CTL1_STRP);
    }
    
    /* configure the first bit MSB function */
    if(ENABLE == p_init->first_bit_msb){
        USART_CTL1(periph) |= USART_CTL1_MSBF;
    }else{
        USART_CTL1(periph) &= ~(USART_CTL1_MSBF);
    }
    
    /* configure the overrun function */
    if(ENABLE == p_init->overrun_disable){
        USART_CTL2(periph) |= USART_CTL2_OVRD;
    }else{
        USART_CTL2(periph) &= ~(USART_CTL2_OVRD);
    }
    
    /* configure the rx error DMA stop function */
    if(ENABLE == p_init->rx_error_dma_stop){
        USART_CTL2(periph) |= USART_CTL2_DDRE;
    }else{
        USART_CTL2(periph) &= ~(USART_CTL2_DDRE);
    }
    
    /* configure the auto baudrate function */
    if(ENABLE == p_init->autobaud.use){
        reg_temp = USART_CTL1(periph);
        reg_temp &= ~(USART_CTL1_ABDM);
        reg_temp |= p_init->autobaud.detection_mode;
        USART_CTL1(periph) = reg_temp; 
    }
    
    /* configure the wakeup from deep-sleep function */
    if(ENABLE == p_init->wakeup.use){
        reg_temp = USART_CTL2(periph);
        reg_temp &= ~(USART_CTL2_WUM);
        reg_temp |= p_init->wakeup.wakeup_by;
        USART_CTL2(periph) = reg_temp;
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      start UART module, note that this function must be called to start USART after initialization
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_uart_start(hal_uart_dev_struct *uart)
{
    usart_enable(uart->periph);
}

/*!
    \brief      stop UART module
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_uart_stop(hal_uart_dev_struct *uart)
{
    usart_disable(uart->periph);
}

/*!
    \brief      handle the UART interrupts
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_uart_irq(hal_uart_dev_struct *uart)
{
    if(RESET == _uart_error_flag_get(uart)){
        /* check whether USART is in receiver mode or not */
        if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_RBNE)){
            if(NULL != uart->uart_irq.receive_complete_handle){
                uart->uart_irq.receive_complete_handle(uart);
            }
            return;
        }
    }else{
        /* check whether the PERR flag is set or not */
        if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_PERR)){
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_PERR);
            uart->error_state |= HAL_USART_ERROR_PERR;
            uart->last_error = HAL_USART_ERROR_PERR;
        }
        
