SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
        /* check whether the NERR flag is set or not */
        if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_ERR_NERR)){
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_NERR);
            uart->error_state |= HAL_USART_ERROR_NERR;
            uart->last_error = HAL_USART_ERROR_NERR;
        }
        
        /* check whether the FERR flag is set or not */
        if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_ERR_FERR)){
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_FERR);
            uart->error_state |= HAL_USART_ERROR_FERR;
            uart->last_error = HAL_USART_ERROR_FERR;
        }
        
        /* check whether the ERR ORERR is set or not */
        if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_ERR_ORERR)){ 
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_ORERR);
            uart->error_state |= HAL_USART_ERROR_ORERR;
            uart->last_error = HAL_USART_ERROR_ORERR;
        }
        
        /* check whether RBNE ORERR is set or not */
        if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_RBNE_ORERR)){ 
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_RBNE_ORERR);
            uart->error_state |= HAL_USART_ERROR_ORERR;
            uart->last_error = HAL_USART_ERROR_ORERR;
        }
        
        /* check whether error state is none or not */
        if(HAL_USART_ERROR_NONE != uart->error_state){
            if(uart->uart_irq.error_handle != NULL){
                uart->uart_irq.error_handle(uart);
                uart->error_state = HAL_USART_ERROR_NONE;
            }
            return;
        }
    }
    
    /* multi-processor mode interrupt handle */
    if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_IDLE)){
        usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_IDLE);
        if(NULL != uart->uart_irq.idle_line_detected_handle){
            uart->uart_irq.idle_line_detected_handle(uart);
        }
    }
    
    /* address match interrput handle */
    if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_AM)){
        usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_AM);
        if(NULL != uart->uart_irq.address_match_handle){
            uart->uart_irq.address_match_handle(uart);
        }
    }
    
    /* LIN mode interrupt handle */
    if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_LBD)){
        usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_LBD);
        if(NULL != uart->uart_irq.lin_break_detected_handle){
            uart->uart_irq.lin_break_detected_handle(uart);
        }
    }
    
    /* wakeup from deepsleep mode interrupt handle */
    if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_WU)){
        usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_WU);
        uart->rx_state = UART_STATE_FREE;
        uart->tx_state = UART_STATE_FREE;
        if(NULL != uart->uart_irq.wakeup_handle){
            uart->uart_irq.wakeup_handle(uart);
        }
    }
    /* hardware flow mode interrupt handle */
    if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_CTS)){
        usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_CTS);
        if(NULL != uart->uart_irq.cts_change_handle){
            uart->uart_irq.cts_change_handle(uart);
        }
    }
    /* transmitter buffer empty interrupt handle */
    if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_TBE)){
        if(NULL != uart->uart_irq.transmit_ready_handle){
            uart->uart_irq.transmit_ready_handle(uart);
        }
        
        return;
    }
    /* transmission complete interrupt handle */
    if(RESET != usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_TC)){
        usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_TC);
        
        if(NULL != uart->uart_irq.transmit_complete_handle){
            uart->uart_irq.transmit_complete_handle(uart);
        }
        
        return;
    }
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  uart: UART device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to UART interrupt callback functions structure
                  The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
      \arg        HAL_INTERRUPT_ENABLE_ONLY: The corresponding callback mechanism is out of use, 
                    while enable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_uart_irq_handle_set(hal_uart_dev_struct *uart, hal_uart_irq_struct *p_irq)
{
    /* set user-defined address match interrupt callback */
    if(NULL != p_irq->address_match_handle){
        uart->uart_irq.address_match_handle = p_irq->address_match_handle;
        usart_interrupt_enable(uart->periph, USART_INT_AM);
    }else{
        uart->uart_irq.address_match_handle = NULL;
        usart_interrupt_disable(uart->periph, USART_INT_AM);
    }
    
    /* set user-defined CTS change interrupt callback */
    if(NULL != p_irq->cts_change_handle){
        uart->uart_irq.cts_change_handle = p_irq->cts_change_handle;
        usart_interrupt_enable(uart->periph, USART_INT_CTS);
    }else{
        uart->uart_irq.cts_change_handle = NULL;
        usart_interrupt_disable(uart->periph, USART_INT_CTS);
    }
    
    /* set user-defined error interrupt callback */
    if(NULL != p_irq->error_handle){
        uart->uart_irq.error_handle = p_irq->error_handle;
        usart_interrupt_enable(uart->periph, USART_INT_ERR);
        usart_interrupt_enable(uart->periph, USART_INT_PERR);
    }else{
        uart->uart_irq.error_handle = NULL;
        usart_interrupt_disable(uart->periph, USART_INT_ERR);
        usart_interrupt_disable(uart->periph, USART_INT_PERR);
    }
    
    /* set user-defined idle line detected interrupt callback */
    if(NULL != p_irq->idle_line_detected_handle){
        uart->uart_irq.idle_line_detected_handle = p_irq->idle_line_detected_handle;
        usart_interrupt_enable(uart->periph, USART_INT_IDLE);
    }else{
        uart->uart_irq.idle_line_detected_handle = NULL;
        usart_interrupt_disable(uart->periph, USART_INT_IDLE);
    }
    
