SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
    /* set user-defined LIN break detected interrupt callback */
    if(NULL != p_irq->lin_break_detected_handle){
        uart->uart_irq.lin_break_detected_handle = p_irq->lin_break_detected_handle;
        usart_interrupt_enable(uart->periph, USART_INT_LBD);
    }else{
        uart->uart_irq.lin_break_detected_handle = NULL;
        usart_interrupt_disable(uart->periph, USART_INT_LBD);
    }
    
    /* set user-defined receive complete interrupt callback */
    if(NULL != p_irq->receive_complete_handle){
        uart->uart_irq.receive_complete_handle = p_irq->receive_complete_handle;
        usart_interrupt_enable(uart->periph, USART_INT_RBNE);
    }else{
        uart->uart_irq.receive_complete_handle = NULL;
        usart_interrupt_disable(uart->periph, USART_INT_RBNE);
    }
    
    /* set user-defined transmit complete interrupt callback */
    if(NULL != p_irq->transmit_complete_handle){
        uart->uart_irq.transmit_complete_handle = p_irq->transmit_complete_handle;
        usart_interrupt_enable(uart->periph, USART_INT_TC);
    }else{
        uart->uart_irq.transmit_complete_handle = NULL;
        usart_interrupt_disable(uart->periph, USART_INT_TC);
    }
    
    /* set user-defined transmit ready interrupt callback */
    if(NULL != p_irq->transmit_ready_handle){
        uart->uart_irq.transmit_ready_handle = p_irq->transmit_ready_handle;
        usart_interrupt_enable(uart->periph, USART_INT_TBE);
    }else{
        uart->uart_irq.transmit_ready_handle = NULL;
        usart_interrupt_disable(uart->periph, USART_INT_TBE);
    }
    
    /* set user-defined wakeup interrupt callback */
    if(NULL != p_irq->wakeup_handle){
        uart->uart_irq.wakeup_handle = p_irq->wakeup_handle;
        usart_interrupt_enable(uart->periph, USART_INT_WU);
    }else{
        uart->uart_irq.wakeup_handle = NULL;
        usart_interrupt_disable(uart->periph, USART_INT_WU);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_uart_irq_handle_all_reset(hal_uart_dev_struct *uart)
{
    /* configure interrupt callback function to NULL */
    uart->uart_irq.address_match_handle = NULL;
    uart->uart_irq.cts_change_handle = NULL;
    uart->uart_irq.error_handle = NULL;
    uart->uart_irq.idle_line_detected_handle = NULL;
    uart->uart_irq.lin_break_detected_handle = NULL;
    uart->uart_irq.receive_complete_handle = NULL;
    uart->uart_irq.transmit_complete_handle = NULL;
    uart->uart_irq.transmit_ready_handle = NULL;
    uart->uart_irq.wakeup_handle = NULL;
}

/*!
    \brief      transmit amounts of data, poll transmit process and completed status
                the function is blocking
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_uart_transmit_poll(hal_uart_dev_struct *uart, void *p_buffer, \
                                uint32_t length, uint32_t timeout_ms)
{
    uint32_t data_length;
    uint32_t temp_val;
    uint32_t tick_start;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->tx_state){
        HAL_DEBUGE("uart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* calculate the data length */
    data_length = 1U;
    if(RESET != (USART_CTL0(uart->periph) & USART_CTL0_WL)){
        if(RESET == (USART_CTL0(uart->periph) & USART_CTL0_PCEN)){
            data_length = 2U;
        }
    }
    
    /* initialize transmit parameters */
    uart->error_state = HAL_USART_ERROR_NONE;
    uart->txbuffer.buffer = (uint8_t *)p_buffer; 
    uart->txbuffer.length = length;
    uart->txbuffer.pos = 0U;
    uart->tx_state = UART_STATE_BUSY;
    /* configure timeout */
    tick_start = hal_basetick_count_get();
    
    temp_val = uart->txbuffer.pos;
    while(temp_val < uart->txbuffer.length){
        /* wait for transmit buffer empty */
        while(RESET == usart_flag_get(uart->periph, USART_FLAG_TBE)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("uart transmit timeout");
                    /* reset the state */
                    uart->rx_state = UART_STATE_FREE;
                    return HAL_ERR_TIMEOUT;
                }
            }
        }
        
        /* send the data to be transmitted */
        if(1U == data_length){
            usart_data_transmit(uart->periph, (*uart->txbuffer.buffer & (uint8_t)0xFFU));
            uart->txbuffer.buffer++;
        }else{
            usart_data_transmit(uart->periph, (*(uint16_t*)uart->txbuffer.buffer & (uint16_t)0x1FFU));
            uart->txbuffer.buffer += data_length;
        }
        /* change the transmit pointer */
        uart->txbuffer.pos++;
        temp_val = uart->txbuffer.pos;
    }
    
    /* wait for transmit complete */
    while(RESET == usart_flag_get(uart->periph, USART_FLAG_TC)){
        if(HAL_TIMEOUT_FOREVER != timeout_ms){
            if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                HAL_DEBUGW("uart transmit timeout");
                return HAL_ERR_TIMEOUT;
            }
        }
    }
    
    /* change the Tx state to free */
    uart->tx_state = UART_STATE_FREE;

