SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data, poll receive process and completed status
                the function is blocking
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_uart_receive_poll(hal_uart_dev_struct *uart, void *p_buffer, \
                               uint32_t length, uint32_t timeout_ms)
{
    uint32_t data_length;
    uint32_t temp_val;
    uint32_t tick_start;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->rx_state){
        HAL_DEBUGE("uart rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* calculate the data length */
    data_length = 1U;
    if(RESET != (USART_CTL0(uart->periph) & USART_CTL0_WL)){
        if(RESET == (USART_CTL0(uart->periph) & USART_CTL0_PCEN)){
            data_length = 2U;
        }
    }
    
    /* initialize receive parameters */
    uart->error_state = HAL_USART_ERROR_NONE;
    uart->rxbuffer.buffer = (uint8_t *)p_buffer; 
    uart->rxbuffer.length = length;
    uart->rxbuffer.pos = 0U;
    uart->data_bit_mask = _uart_data_bit_mask_get(uart);
    uart->rx_state = UART_STATE_BUSY;
    /* configure timeout */
    tick_start = hal_basetick_count_get();
    
    temp_val = uart->rxbuffer.pos;
    while(temp_val < uart->rxbuffer.length){
        /* wait for read data buffer not empty */
        while(RESET == usart_flag_get(uart->periph, USART_FLAG_RBNE)){
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    HAL_DEBUGW("uart receive timeout");
                    /* reset the state */
                    uart->rx_state = UART_STATE_FREE;
                    return HAL_ERR_TIMEOUT;
                }            
            }
        }
        
        /* read data from data register */
        if(1 == data_length){
            *uart->rxbuffer.buffer = (uint8_t)(usart_data_receive(uart->periph) & uart->data_bit_mask);
            uart->rxbuffer.buffer++;
        }else{
            *(uint16_t*)uart->rxbuffer.buffer = (usart_data_receive(uart->periph) & uart->data_bit_mask);
             uart->rxbuffer.buffer += data_length;
        }
        
        /* change the receive pointer */
        uart->rxbuffer.pos++;
        temp_val = uart->rxbuffer.pos;
    }
    
    /* change the Rx state to free */
    uart->rx_state = UART_STATE_FREE;

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by interrupt method, after the transfer is completed, 
                the user function is called
                the function is non-blocking
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_uart_transmit_interrupt(hal_uart_dev_struct *uart, void *p_buffer, \
                                     uint32_t length, hal_uart_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->tx_state){
        HAL_DEBUGE("uart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize transmit parameters */
    uart->tx_state = UART_STATE_BUSY;
    uart->error_state = HAL_USART_ERROR_NONE;
    uart->txbuffer.buffer = (uint8_t *)p_buffer; 
    uart->txbuffer.length = length;
    uart->txbuffer.pos = 0U;
    uart->tx_callback = (void *)p_user_func;
    /* configure the transmit ready and complete callback as the function implemented */
    uart->uart_irq.transmit_ready_handle = _uart_transmit_interrupt;
    uart->uart_irq.transmit_complete_handle = _uart_transmit_complete_interrupt;
    
    /* clear USART TC interrupt flag */
    usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_TC);

    /* enable the TBE interrupt */
    usart_interrupt_enable(uart->periph, USART_INT_TBE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by interrupt method, after the transfer is completed, 
                the user function is called
                the function is non-blocking
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_uart_receive_interrupt(hal_uart_dev_struct *uart, void *p_buffer, \
                                    uint32_t length, hal_uart_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->rx_state){
        HAL_DEBUGE("uart rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
