SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
    /* initialize receive parameters */
    uart->rx_state = UART_STATE_BUSY;
    uart->error_state = HAL_USART_ERROR_NONE;
    uart->rxbuffer.buffer = (uint8_t *)p_buffer; 
    uart->rxbuffer.length = length;
    uart->rxbuffer.pos = 0U;
    uart->rx_callback = (void *)p_user_func;
    uart->uart_irq.receive_complete_handle = _uart_receive_interrupt;
    uart->data_bit_mask = _uart_data_bit_mask_get(uart);
    
    /* enable PERR, ERR, RBNE interrupt */
    usart_interrupt_enable(uart->periph, USART_INT_PERR);
    usart_interrupt_enable(uart->periph, USART_INT_ERR);
    usart_interrupt_enable(uart->periph, USART_INT_RBNE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by DMA method, after the transfer is completed or error occurs, 
                the user function is called
                the function is non-blocking
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_uart_transmit_dma(hal_uart_dev_struct *uart, void *p_buffer, \
                              uint32_t length, hal_uart_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameter */
    if(NULL == uart->p_dma_tx){
        HAL_DEBUGE("parameter [uart->p_dma_tx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->tx_state){
        HAL_DEBUGE("uart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    
    /* initialize transmit parameters */
    uart->tx_state = UART_STATE_BUSY;
    uart->error_state = HAL_USART_ERROR_NONE;
    uart->txbuffer.buffer = (uint8_t *)p_buffer; 
    uart->txbuffer.length = length;
    uart->txbuffer.pos = 0U;
    if(NULL != p_func){
        uart->tx_callback = (void *)p_func->complete_func;
        uart->uart_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    }else{
        uart->tx_callback = NULL;
        uart->uart_irq.error_handle = NULL;
    }
    uart->uart_irq.transmit_complete_handle = _uart_transmit_complete_interrupt;
    
    /* configure DMA interrupt callback function */
    dma_irq.full_finish_handle = _uart_transmit_dma;
    dma_irq.error_handle = _uart_dma_error;
    if(NULL != uart->p_dma_tx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = uart->p_dma_tx->dma_irq.half_finish_handle;
    }
    
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(uart->p_dma_tx, (uint32_t)uart->txbuffer.buffer, \
                           uart->periph + 0x28U, length, &dma_irq);
    /* clear DMA global interrupt flag */
    dma_flag_clear(uart->p_dma_tx->channel, DMA_FLAG_G);
    
    /* clear USART TC interrupt flag */
    usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_TC);

    /* DMA enable for transmission */
    usart_dma_transmit_config(uart->periph, USART_DENT_ENABLE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by DMA method, after the transfer is completed or error occurs, 
                the user function is called
                the function is non-blocking
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_uart_receive_dma(hal_uart_dev_struct *uart, void *p_buffer, \
                              uint32_t length, hal_uart_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)){
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameter */
    if(NULL == uart->p_dma_rx){
        HAL_DEBUGE("parameter [uart->p_dma_rx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the rx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->rx_state){
        HAL_DEBUGE("uart rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
    
    /* initialize DMA interrupt callback function structure with default value */
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    
    /* initialize receive parameters */
    uart->rx_state = UART_STATE_BUSY;
    uart->error_state = HAL_USART_ERROR_NONE;
    uart->rxbuffer.buffer = (uint8_t *)p_buffer; 
    uart->rxbuffer.length = length;
    uart->rxbuffer.pos = 0U;
    if(NULL != p_func){
        uart->rx_callback = (void *)p_func->complete_func;
        uart->uart_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    }else{
        uart->rx_callback = NULL;
        uart->uart_irq.error_handle = NULL;
    }
    uart->data_bit_mask = _uart_data_bit_mask_get(uart);
    
