SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
    /* enable the usart parity error and error interrupt: (frame error, noise error, overrun error) */
    usart_interrupt_enable(uart->periph, USART_INT_PERR);
    usart_interrupt_enable(uart->periph, USART_INT_ERR);
    
    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle = _uart_receive_dma;
    dma_irq.error_handle = _uart_dma_error;
    if(NULL != uart->p_dma_rx->dma_irq.half_finish_handle){
        dma_irq.half_finish_handle = uart->p_dma_rx->dma_irq.half_finish_handle;
    }
    
    /* start DMA interrupt mode transfer */
    hal_dma_start_interrupt(uart->p_dma_rx, uart->periph + 0x24U,\
                            (uint32_t)uart->rxbuffer.buffer, length, &dma_irq);
    /* clear DMA global interrupt flag */
    dma_flag_clear(uart->p_dma_tx->channel, DMA_FLAG_G);
    /* DMA enable for reception */
    usart_dma_receive_config(uart->periph, USART_DENR_ENABLE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      pause UART DMA transfer during transmission process
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_dma_pause(hal_uart_dev_struct *uart)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->tx_state){
        /* disable DMA transimt */
        usart_dma_transmit_config(uart->periph, USART_DENT_DISABLE);
    }
    
    /* check the rx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->rx_state){
        /* disable the PERR and ERR interrupt */
        usart_interrupt_disable(uart->periph, USART_INT_PERR);
        usart_interrupt_disable(uart->periph, USART_INT_ERR);
        
        /* disable DMA receive */
        usart_dma_receive_config(uart->periph, USART_DENR_DISABLE);
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      resume UART DMA transfer during transmission process
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_dma_resume(hal_uart_dev_struct *uart)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check the tx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->tx_state){
        /* enable DMA transimt */
        usart_dma_transmit_config(uart->periph, USART_DENT_ENABLE);
    }
    
    /* check the rx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->rx_state){
        /* enable the PERR and ERR interrupt */
        usart_interrupt_enable(uart->periph, USART_INT_PERR);
        usart_interrupt_enable(uart->periph, USART_INT_ERR);
        
        /* enable DMA receive */
        usart_dma_receive_config(uart->periph, USART_DENR_ENABLE);
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      stop UART transmit transfer
                the function is blocking
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_transmit_stop(hal_uart_dev_struct *uart)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* disable the TBE and TC interrupt */
    usart_interrupt_disable(uart->periph, USART_INT_TBE);
    usart_interrupt_disable(uart->periph, USART_INT_TC);
    
    /* disable DMA transimt and stop DMA */
    usart_dma_transmit_config(uart->periph, USART_DENT_DISABLE);
    hal_dma_stop(uart->p_dma_tx);
    
    /* reset the position and state */
    uart->txbuffer.pos = 0;
    uart->tx_state = UART_STATE_FREE;
    
    return HAL_ERR_NONE;
}

/*!
    \brief      stop UART receive transfer
                the function is blocking
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_receive_stop(hal_uart_dev_struct *uart)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* disable the RBNE, PERR and ERR interrupt */
    usart_interrupt_disable(uart->periph, USART_INT_RBNE);
    usart_interrupt_disable(uart->periph, USART_INT_PERR);
    usart_interrupt_disable(uart->periph, USART_INT_ERR);
    
    /* disable DMA receive and stop DMA */
    usart_dma_receive_config(uart->periph, USART_DENR_DISABLE);
    hal_dma_stop(uart->p_dma_rx);
    
    /* reset the position and state */
    uart->rxbuffer.pos = 0;
    uart->rx_state = UART_STATE_FREE;
    
    /* clear interrupt error flags */
    usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_PERR);
    usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_FERR);
    usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_NERR);
    usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_ORERR);
    
