SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
    return HAL_ERR_NONE;
}

/*!
    \brief      enable the UART works in which mode
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  mode: work mode
      \arg        UART_WORK_MODE_SINGLE_WIRE: single wire(half-duplex) communication mode
      \arg        UART_WORK_MODE_MULTIPROCESSCOR: multiprocessor communication mode
      \arg        UART_WORK_MODE_LIN: LIN mode
      \arg        UART_WORK_MODE_RS485: RS485 mode
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_work_mode_enable(hal_uart_dev_struct *uart, hal_uart_work_mode_enum mode)
{
    uint8_t uen_flag = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == mode)){
        HAL_DEBUGE("parameter [uart] or [mode] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;

    switch(mode){
        case UART_WORK_MODE_SINGLE_WIRE:
            /* enable the single wire (half-duplex) mode */
            usart_halfduplex_enable(uart->periph);
            break;
        case UART_WORK_MODE_MULTIPROCESSCOR:
            /* enable the multi-processor mode */
            usart_mute_mode_enable(uart->periph);
            break;
        case UART_WORK_MODE_LIN:
            /* enable the LIN mode */
            usart_lin_mode_enable(uart->periph);
            break;
        case UART_WORK_MODE_RS485:
            /* enable the RS485 mode */
            usart_rs485_driver_enable(uart->periph);
            break;
        default:
            HAL_DEBUGI("[mode] value is out of range");
            break;
    }
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      disable the UART work mode
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  mode: work mode
      \arg        UART_WORK_MODE_SINGLE_WIRE: single wire(half-duplex) communication mode
      \arg        UART_WORK_MODE_MULTIPROCESSCOR: multiprocessor communication mode
      \arg        UART_WORK_MODE_LIN: LIN mode
      \arg        UART_WORK_MODE_RS485: RS485 mode
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_work_mode_disable(hal_uart_dev_struct *uart, hal_uart_work_mode_enum mode)
{
    uint8_t uen_flag = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == mode)){
        HAL_DEBUGE("parameter [uart] or [mode] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;
    
    switch(mode){
        case UART_WORK_MODE_SINGLE_WIRE:
            /* disable the single wire (half-duplex) mode */
            usart_halfduplex_disable(uart->periph);
            break;
        case UART_WORK_MODE_MULTIPROCESSCOR:
            /* disable the multi-processor mode */
            usart_mute_mode_disable(uart->periph);
            break;
        case UART_WORK_MODE_LIN:
            /* disable the LIN mode */
            usart_lin_mode_disable(uart->periph);
            break;
        case UART_WORK_MODE_RS485:
            /* disable the RS485 mode */
            usart_rs485_driver_disable(uart->periph);
            break;
        default:
            HAL_DEBUGI("[mode] value is out of range");
            break;
    }
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      enable the UART command 
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  cmd: command
      \arg        HAL_UART_CMD_ENTER_MUTE: mute mode command 
      \arg        HAL_UART_CMD_SEND_BREAK: send break command 
      \arg        HAL_UART_CMD_AUTOBAUD_DETECTION: auto baudrate detection command
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_command_enable(hal_uart_dev_struct *uart, hal_uart_command_enum cmd)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == cmd)){
        HAL_DEBUGE("parameter [uart] or [cmd] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    usart_command_enable(uart->periph, (uint32_t)cmd);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      enable transmit in single wire(half-duplex) mode
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_singlewire_transmit_enable(hal_uart_dev_struct *uart)
{
    uint8_t uen_flag = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;
    
    /* disable Tx and Rx */
    usart_transmit_config(uart->periph, USART_TRANSMIT_DISABLE);
    usart_receive_config(uart->periph, USART_RECEIVE_DISABLE);
    
    /* enable Tx */
    usart_transmit_config(uart->periph, USART_TRANSMIT_ENABLE);
    
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }
    
