SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
    return HAL_ERR_NONE;
}

/*!
    \brief      disable transmit in single wire(half-duplex) mode
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_singlewire_transmit_disable(hal_uart_dev_struct *uart)
{
    uint8_t uen_flag = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;
    
    /* disable Tx */
    usart_transmit_config(uart->periph, USART_TRANSMIT_DISABLE);
    
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      enable receive in single wire(half-duplex) mode
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_singlewire_receive_enable(hal_uart_dev_struct *uart)
{
    uint8_t uen_flag = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;
    
    /* disable Tx and Rx */
    usart_transmit_config(uart->periph, USART_TRANSMIT_DISABLE);
    usart_receive_config(uart->periph, USART_RECEIVE_DISABLE);
    
    /* enable Rx */
    usart_receive_config(uart->periph, USART_RECEIVE_ENABLE);
    
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      disable receive in single wire(half-duplex) mode
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_singlewire_receive_disable(hal_uart_dev_struct *uart)
{
    uint8_t uen_flag = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;
    
    /* disable Rx */
    usart_receive_config(uart->periph, USART_RECEIVE_DISABLE);
    
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      enable UART to wakeup the mcu from deep-sleep mode
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_wakeup_enable(hal_uart_dev_struct *uart)
{
    uint8_t uen_flag = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;
    
    /* enable wakeup function */
    usart_wakeup_enable(uart->periph);
    
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      disable UART to wakeup the mcu from deep-sleep mode
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_wakeup_disable(hal_uart_dev_struct *uart)
{
    uint8_t uen_flag = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;
    
    /* disable wakeup function */
    usart_wakeup_disable(uart->periph);
    
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      configure UART wakeup mode from deep-sleep mode
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  wum: wakeup mode
      \arg        UART_WAKEUP_BY_ADDRESS: WUF active on address match
      \arg        UART_WAKEUP_BY_START_BIT: WUF active on start bit
      \arg        UART_WAKEUP_BY_RBNE_SET: WUF active on RBNE
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_wakeup_mode_config(hal_uart_dev_struct *uart, uint32_t wum)
{
    uint8_t uen_flag = 0U;
    
