SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || ((UART_WAKEUP_BY_ADDRESS != wum) && (UART_WAKEUP_BY_START_BIT != wum) \
            && (UART_WAKEUP_BY_RBNE_SET != wum))){
        HAL_DEBUGE("parameter [uart] or [wum] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;
    
    usart_wakeup_mode_config(uart->periph, wum);
    
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      configure the UART address detection mode
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  add_mode: address mode
      \arg        UART_MULTIPROCESSOR_ADDRESS_4BIT: 4-bit address detection
      \arg        UART_MULTIPROCESSOR_ADDRESS_FULLBIT: full-bit address detection
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_multiprocessor_address_mode_config(hal_uart_dev_struct *uart, uint32_t add_mode)
{
    uint8_t uen_flag = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || ((UART_MULTIPROCESSOR_ADDRESS_4BIT != add_mode) && \
            (UART_MULTIPROCESSOR_ADDRESS_FULLBIT != add_mode))){
        HAL_DEBUGE("parameter [uart] or [add_mode] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;
    
    usart_address_detection_mode_config(uart->periph, add_mode);
    
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      set the address of the UART terminal
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  addr: address
      \arg        0x00 - 0xFF
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32e23x_hal.h
*/
int32_t hal_uart_multiprocessor_address_set(hal_uart_dev_struct *uart, uint8_t addr)
{
    uint8_t uen_flag = 0U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* store the UEN flag */
    uen_flag = USART_CTL0(uart->periph) & USART_CTL0_UEN;
    
    usart_address_config(uart->periph, addr);
    
    /* restore the UEN flag */
    if(RESET != uen_flag){
        usart_enable(uart->periph);
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      configure the UART baudrate and stop bits, the other parameters are configured as default values
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which USART is configured
    \param[in]  baud: baudrate
    \param[in]  stopbits: USART_STB_1BIT, USART_STB_0_5BIT, USART_STB_2BIT, USART_STB_1_5BIT
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32e23x_hal.h
*/
int32_t hal_uart_simple_config(hal_uart_dev_struct *uart, uint32_t periph, uint32_t baud, uint32_t stopbits)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
    
    /* check the parameters */
    if(((USART0 != periph) && (USART1 != periph)) || (0U == baud)){
        HAL_DEBUGE("parameter [periph] or [baud] value is invalid"); 
        return HAL_ERR_VAL;
    }
    
    /* check the parameter */
    if((USART_STB_1BIT != stopbits) && (USART_STB_0_5BIT != stopbits) && (USART_STB_2BIT != stopbits) && \
        (USART_STB_1_5BIT != stopbits)){
        HAL_DEBUGE("parameter [stopbit] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check the tx_state or rx_state wheher is busy or not */
    if((UART_STATE_BUSY == uart->tx_state) || (UART_STATE_BUSY == uart->rx_state)){
        HAL_DEBUGE("uart is in tx or rx state, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    uart->periph = periph;
    /* deinitilize USART */
    usart_deinit(periph);
    /* configure the UART baudrate and stop bits */
    usart_baudrate_set(periph, baud);
    usart_stop_bit_set(periph, stopbits);
    /* the other parameters are configured as default values */
    usart_parity_config(periph, USART_PM_NONE);
    usart_word_length_set(periph, USART_WL_8BIT);
    usart_receive_config(periph, USART_RECEIVE_ENABLE);
    usart_transmit_config(periph, USART_TRANSMIT_ENABLE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      configure the UART baudrate, parity and stop bits
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  data_bits
      \arg        8: 8 data bits
      \arg        9: 9 data bits
    \param[in]  parity
      \arg        0: parity none
      \arg        1: parity odd
      \arg        2: parity even
    \param[in]  stop_bits
      \arg        1: 1 stop bit
      \arg        2: 2 stop bits
    \param[out] none
    \retval     
*/
void hal_uart_format(hal_uart_dev_struct *uart, int data_bits, int parity, int stop_bits)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart){
        HAL_DEBUGE("parameter [uart] value is invalid");
        return;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
