SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_uart.c
    /* disable USART */
    usart_disable(uart->periph);
    
    /* configure USART parity */
    switch(parity){
        case 1:
            usart_parity_config(uart->periph, USART_PM_ODD);
            break;
        case 2:
            usart_parity_config(uart->periph, USART_PM_EVEN);
            break;
        case 0:
        default:
            usart_parity_config(uart->periph, USART_PM_NONE);
            break;
    }

    /* configure USART word length */
    if(data_bits == 9){
        usart_word_length_set(uart->periph, USART_WL_9BIT);
    }else{
        usart_word_length_set(uart->periph, USART_WL_8BIT);
    }

    /* configure USART stop bits */
    if(stop_bits == 2){
        usart_stop_bit_set(uart->periph, USART_STB_2BIT);
    }else{
        usart_stop_bit_set(uart->periph, USART_STB_1BIT);
    }

    /* enable USART */
    usart_enable(uart->periph);
}

/*!
    \brief      get the mask of date bit
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the mask of date bit(0x7F, 0xFF, 0x1FF)
*/
static uint16_t _uart_data_bit_mask_get(hal_uart_dev_struct *uart)
{
    uint16_t reval;
    
    if(RESET != (USART_CTL0(uart->periph) & USART_CTL0_WL)){
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(uart->periph) & USART_CTL0_PCEN)){
            reval = 0xFFU;
        }else{
            reval = 0x1FFU;
        }
    }else{
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(uart->periph) & USART_CTL0_PCEN)){
            reval = 0x7FU;
        }else{
            reval = 0xFFU;
        }
    }
    
    return reval;
}

/*!
    \brief      get UART error flag
    \param[in]  uart: UART device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     SET or RESET
*/
static FlagStatus _uart_error_flag_get(hal_uart_dev_struct *uart)
{
    if(0U == (USART_STAT(uart->periph) & (uint32_t)(USART_STAT_PERR | USART_STAT_FERR | \
                                                    USART_STAT_ORERR | USART_STAT_NERR))){
        return RESET;
    }else{
        return SET;
    }
}

/*!
    \brief      handle the transmit complete interrupt
    \param[in]  uart: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _uart_transmit_complete_interrupt(void *uart)
{
    hal_uart_dev_struct *p_uart = uart;
    hal_uart_user_cb p_func = (hal_uart_user_cb)p_uart->tx_callback;
    
    /* disable the transmit complete interrupt */
    usart_interrupt_disable(p_uart->periph, USART_INT_TC);
    /* reset transmit_complete_handle and tx_state */
    p_uart->uart_irq.transmit_complete_handle = NULL;
    p_uart->tx_state = UART_STATE_FREE;
    
    if(NULL != p_func){
        /* if there is a user transmit complete callback */
        p_func(p_uart);
    }
}

/*!
    \brief      handle the transmit interrupt
    \param[in]  uart: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _uart_transmit_interrupt(void *uart)
{
    uint32_t temp_val;
    hal_uart_dev_struct *p_uart = uart;
    
    temp_val = p_uart->txbuffer.pos;
    if(temp_val < p_uart->txbuffer.length){
        if((RESET != (USART_CTL0(p_uart->periph) & USART_CTL0_WL)) && \
           (RESET == (USART_CTL0(p_uart->periph) & USART_CTL0_PCEN))){
            /* 9-bit data, none parity */
            usart_data_transmit(p_uart->periph, (*(uint16_t*)p_uart->txbuffer.buffer & (uint16_t)0x1FFU));
            p_uart->txbuffer.buffer += 2U;
        }else{
            /* 9-bit data, with parity or 8-bit data */
            usart_data_transmit(p_uart->periph, (*p_uart->txbuffer.buffer & (uint8_t)0xFFU));
            p_uart->txbuffer.buffer++;
        }
        p_uart->txbuffer.pos++;
    }else{
        /* disable the TBE interrupt, enable the TC interrupt and reset the transmit_ready_handle */
        usart_interrupt_disable(p_uart->periph, USART_INT_TBE);
        usart_interrupt_enable(p_uart->periph, USART_INT_TC);
        p_uart->uart_irq.transmit_ready_handle = NULL;
    }
}

/*!
    \brief      handle the receive interrupt
    \param[in]  uart: pointer to a UART device information structure
    \param[out] none
    \retval     none
*/
static void _uart_receive_interrupt(void *uart)
{
    uint16_t recv_data;
    hal_uart_dev_struct *p_uart = uart;
    uint32_t temp_val;
    
    recv_data = (usart_data_receive(p_uart->periph) & p_uart->data_bit_mask);
    if(0x1FFU == p_uart->data_bit_mask){
        /* store the received data */
        *(uint16_t *)p_uart->rxbuffer.buffer = recv_data;
        p_uart->rxbuffer.buffer += 2U;
    }else{
        /* store the received data */
        *p_uart->rxbuffer.buffer = (uint8_t)recv_data;
        p_uart->rxbuffer.buffer++;
    }
    p_uart->rxbuffer.pos++;
    
    temp_val = p_uart->rxbuffer.pos;
    if(temp_val == p_uart->rxbuffer.length){
        hal_uart_user_cb p_func = (hal_uart_user_cb)p_uart->rx_callback;
        /* disable PERR, ERR, RBNE interrupt */
        usart_interrupt_disable(p_uart->periph, USART_INT_PERR);
        usart_interrupt_disable(p_uart->periph, USART_INT_ERR);
        usart_interrupt_disable(p_uart->periph, USART_INT_RBNE);
        /* reset receive_complete_handle and rx_state */
        p_uart->uart_irq.receive_complete_handle = NULL;
        p_uart->rx_state = UART_STATE_FREE;
        
        if(NULL != p_func){
            /* if there is a user receive complete callback */
            p_func(p_uart);
        }
    }
}

/*!
    \brief      handle the UART DMA transmit process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _uart_transmit_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_uart_dev_struct *p_uart;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_uart = (hal_uart_dev_struct*)p_dma->p_periph;
    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)){
        p_uart->txbuffer.pos = p_uart->txbuffer.length;
        usart_dma_transmit_config(p_uart->periph, USART_DENT_DISABLE);
        /* enable TC interrupt */
        usart_interrupt_enable(p_uart->periph, USART_INT_TC);
    }
}

/*!
    \brief      handle the UART DMA receive process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _uart_receive_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_uart_dev_struct *p_uart;
    hal_uart_user_cb p_func;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_uart = (hal_uart_dev_struct*)p_dma->p_periph;
    p_func = (hal_uart_user_cb)p_uart->rx_callback;
    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)){
        p_uart->rxbuffer.pos = p_uart->rxbuffer.length;
        /* disable DMA receive, PERR and ERR interrupt */
        usart_dma_receive_config(p_uart->periph, USART_DENR_DISABLE);
        usart_interrupt_disable(p_uart->periph, USART_INT_PERR);
        usart_interrupt_disable(p_uart->periph, USART_INT_ERR);
        /* reset rx_state */
        p_uart->rx_state = UART_STATE_FREE;
    }
    
    if(NULL != p_func){
        /* if there is a user receive complete callback */
        p_func(p_uart);
    }
}

/*!
    \brief      handle the UART DMA error process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _uart_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_uart_dev_struct *p_uart;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_uart = (hal_uart_dev_struct*)p_dma->p_periph;

    if(UART_STATE_BUSY == p_uart->tx_state){
        /* transmit state is busy */
        p_uart->error_state |= HAL_USART_ERROR_DMATX;
        p_uart->last_error = HAL_USART_ERROR_DMATX;
        p_uart->txbuffer.pos = p_uart->txbuffer.length;
        /* disable DMA transmit and reset tx_state */
        usart_dma_transmit_config(p_uart->periph, USART_DENT_DISABLE);
        p_uart->tx_state = UART_STATE_FREE;
    }else if(UART_STATE_BUSY == p_uart->rx_state){
        /* receive state is busy */
        p_uart->error_state |= HAL_USART_ERROR_DMARX;
        p_uart->last_error = HAL_USART_ERROR_DMARX;
        p_uart->rxbuffer.pos = p_uart->rxbuffer.length;
        /* disable DMA receive, PERR, ERR interrupt */
        usart_dma_receive_config(p_uart->periph, USART_DENR_DISABLE);
        usart_interrupt_disable(p_uart->periph, USART_INT_PERR);
        usart_interrupt_disable(p_uart->periph, USART_INT_ERR);
        /* reset rx_state */
        p_uart->rx_state = UART_STATE_FREE;
    }else{
        HAL_DEBUGE("uart processor fatal error: dma error exception due to run state");
    }

    if(p_uart->uart_irq.error_handle != NULL){
        /* if there is a user error callback */
        p_uart->uart_irq.error_handle(p_uart);
        p_uart->error_state = HAL_USART_ERROR_NONE;
    }
}
